### Retrieving data from MySQL using SQLAlchemy and MySQLConnector

In [2]:
# Importing modules and Libraries

from sqlalchemy import create_engine
import pandas as pd

In [4]:
engine_string="mysql+mysqlconnector://root:root@localhost:3306/eda_assignment_5"
engine=create_engine(engine_string)

In [6]:
query="Select * from SampleFakerData2"
Faker_retrieved_df=pd.read_sql_query(query,con=engine)

In [9]:
Faker_retrieved_df.head()

,customer_id,customer_name,product_id,purchase_date,quantity,price_per_unit,region
0,1000,Rachael Anderson,19,2024-09-22,10,24.92,South
1,1001,Andrew Arnold,4,2023-12-16,3,58.41,East
2,1002,Jason Andersen,4,2024-07-01,7,99.57,South
3,1003,Joanne Collins,18,2024-06-20,5,31.95,North
4,1004,Cristian Cross,19,2024-08-02,4,69.11,East

### EDA Tasks

In [12]:
# Summary Statistics

Faker_retrieved_df[['quantity','price_per_unit']].describe()

         quantity  price_per_unit
count  200.000000      200.000000
mean     5.430000       53.205100
std      2.894302       26.357942
min      1.000000       11.370000
25%      3.000000       29.790000
50%      5.500000       51.380000
75%      8.000000       75.402500
max     10.000000       99.570000

In [20]:
# Sales per Region

Faker_retrieved_df['sales']=Faker_retrieved_df['quantity']*Faker_retrieved_df['price_per_unit']
Total_Sales_byRegion_df=Faker_retrieved_df[['sales']].groupby(Faker_retrieved_df['region']).sum()
Total_Sales_byRegion_df

           sales
region
East    11998.45
North   14851.02
South   16068.33
West    14853.50

In [22]:
# Top 5 Customers based on total amount spent
top5_df=Faker_retrieved_df[['customer_id','customer_name','sales']].nlargest(5,'sales')
top5_df

     customer_id    customer_name   sales
150         1150  Douglas Ramirez  950.70
83          1083      Tamara Bird  862.90
149         1149     Erika Carter  853.70
106         1106    Travis Willis  831.87
128         1128    Holly Collins  823.32